package com.cursor;

import java.util.Scanner;

public class Main {

    public static void main(String[] args) {

        System.out.println("Привіт, тебе вітає UNO_Counter. Введи кількість іграків :");
        Scanner sc = new Scanner(System.in);
        String input = sc.nextLine();
        int counter = 0;

        switch (input){
            case "3"-> System.out.println("Ваші імена: Ігрок 1 - Василькін; Ігрок 2 - Петрулькін; Ігрок 3 - Степулькін");
            case "4"-> System.out.println("Ваші імена: Ігрок 1 - Василькін; Ігрок 2 - Петрулькін; Ігрок 3 - Степулькін;" +
                    "Ігрок 4 - Анюлькін");
            case "5"-> System.out.println("Ваші імена: Ігрок 1 - Василькін; Ігрок 2 - Петрулькін; Ігрок 3 - Степулькін;" +
                    "Ігрок 4 - Анюлькін; Ігрок 5 - Бірюлькін");
            case "6"-> System.out.println("Ваші імена: Ігрок 1 - Василькін; Ігрок 2 - Петрулькін; Ігрок 3 - Степулькін;" +
                    "Ігрок 4 - Анюлькін; Ігрок 5 - Бірюлькін; Ігрок 6 - Катапулькін");
            case "7"-> System.out.println("Ваші імена: Ігрок 1 - Василькін; Ігрок 2 - Петрулькін; Ігрок 3 - Степулькін" +
                    "Ігрок 4 - Анюлькін; Ігрок 5 - Бірюлькін; Ігрок 6 - Катапулькін; Ігрок 7 - Бурулькін");
            case "8"-> System.out.println("Ваші імена: Ігрок 1 - Василькін; Ігрок 2 - Петрулькін; Ігрок 3 - Степулькін" +
                    "Ігрок 4 - Анюлькін; Ігрок 5 - Бірюлькін; Ігрок 6 - Катапулькін; Ігрок 7 - Бурулькін; " +
                    "Ігрок 8 - Сусулькін");
            case "9"-> System.out.println("Ваші імена: Ігрок 1 - Василькін; Ігрок 2 - Петрулькін; Ігрок 3 - Степулькін" +
                    "Ігрок 4 - Анюлькін; Ігрок 5 - Бірюлькін; Ігрок 6 - Катапулькін; Ігрок 7 - Бурулькін; " +
                    "Ігрок 8 - Сусулькін; Ігрок 9 - Кузюлькін");
            case "10"->System.out.println("Ваші імена: Ігрок 1 - Василькін; Ігрок 2 - Петрулькін; Ігрок 3 - Степулькін" +
                    "Ігрок 4 - Анюлькін; Ігрок 5 - Бірюлькін; Ігрок 6 - Катапулькін; Ігрок 7 - Бурулькін; " +
                                         "Ігрок 8 - Сусулькін; Ігрок 9 - Козюлькін; Ігрок 10 - Барабулькін");

        }
        System.out.println("По ходу гри вам портібно вводити кількість отриманих балів");
    }
}
